[
    {
        "name": "#stop",
        "note": "остановить процесс"
    },

    {
        "name": "#pause",
        "note": "приостоновить процесс (если кончились ресурсы)"
    },

    {
        "name": "#resume",
        "note": "продолжить процесс"
    },

    {
        "name": "#click",
        "note": "выделение области (прописываешь команду, зажимаешь ЛКМ на угловом блоке и тянешь до другого, отпускаешь, ESC для разблокировки чата для следующей команды)"
    },

    {
        "name": "#sel clear",
        "note": "удалить выделение области"
    },

    {
        "name": "#allowInventory",
        "note": "(true или false) Разрешить использовать предметы из инвентаря."
    },


    {
        "name": "#buildinlayers",
        "note": "(true или false) постройка, очистка по слоям, а не алгоритму ближнего блока."
    },

    {
        "name": "#sel set ИМЯБЛОКА",
        "note": "заложить выделенную область указанным блоком"
    },

    {
        "name": "#build имясхемы.schematic",
        "note": "построить схему"
    },

    {
        "name": "#goto x y z",
        "note": "прийти на координаты"
    },

    {
        "name": "#goto -123 90 75",
        "note": "прийти на координаты x=-123 y=90 z=75 | ~ текущая координата"
    },

    {
        "name": "#follow player ник",
        "note": "следовать за игроком"
    },

    {
        "name": "#tunnel ширина высота длина",
        "note": "тунел по заданным параметрам"
    },

    {
        "name": "#tunnel 2 3 100",
        "note": "тунель для лошадей"
    },

    {
        "name": "#mine lapis_ore redstone_ore diamond_ore quartz_ore",
        "note": "для починки инструмена"
    },

    {
        "name": "#sel expand o направление кол-во",
        "note": "расширить выделение в сторону на несколько блоков"
    },

    {
        "name": "F3 + G",
        "note": "отображения границ чанка"
    }
]