const array = [
    {
        "name": "goal",
        "note": "устанавливает цель",
        "arg":[
            "x y z",
            "x z",
            " ",
            "clear"
        ]
    },
    {
        "name": "goto",
        "note": "прийти на координаты",
        "arg":[
            "x y z",
            "x z"
        ]
    },
    {
        "name": "follow",
        "note": "следовать за игроком",
        "arg":[
            "player ник",
            "entity название_существа"
        ]
    },
    {
        "name": "sel",
        "note":[
            ""
        ],
        "arg":[
            "1",
            "2",
            "clear", // удалить выделение области
            "expand o направление кол-во", // расширить выделение в сторону на несколько блоков
            "cleararea",
            "fill ИМЯБЛОКА", // заложить выделенную область указанным блоком
            "set ИМЯБЛОКА", // заложить выделенную область указанным блоком
            "replace ИМЯБЛОКА1 ИМЯБЛОКА2"
        ]
    },
    {
        "name": "blockreachdistance",
        "note": "дистанция вскапывания (4 - стабильное значение)",
        "arg":[
            4.5,
            4
        ]
    },

    {
        "name": "allowInventory",
        "note": "Разрешить использовать предметы из инвентаря.",
        "arg":[
            false,
            true
        ]
    },


    {
        "name": "buildinlayers",
        "note": "постройка, очистка по слоям, а не алгоритму ближнего блока.",
        "arg":[
            false,
            true
        ]
    },
    {
        "name": "mine",
        "note": "для починки инструмена",
        "arg":[
            "ИМЯБЛОКА",
            // "lapis_ore redstone_ore diamond_ore quartz_ore"
        ]
    },

    {
        "name": "build",
        "note": "построить схему",
        "arg":["имясхемы.schematic"]
    },
    {
        "name": "tunnel",
        "note": "тунел по заданным параметрам",
        "arg":[
            "ШИРИНА ВЫСОТА ДЛИНА" // 2 3 100 тунель для лошадей
        ]
    },

    {
        "name": "F3 + G",
        "note": "отображения границ чанка"
    },
    {
        "name": "path",
        "note": "проложить путь к цели",
    },
    {
        "name": "invert",
        "note": "проложить путь от цели"
    },
    {
        "name": "goto -123 90 75",
        "note": "прийти на координаты x=-123 y=90 z=75 | ~ текущая координата"
    },
    {
        "name": "stop",
        "note": "остановить процесс"
    },
    {
        "name": "cancel",
        "note": "остановить процесс"
    },
    {
        "name": "pause",
        "note": "приостоновить процесс (если кончились ресурсы)"
    },

    {
        "name": "resume",
        "note": "продолжить процесс"
    },

    {
        "name": "click",
        "note": "выделение области (прописываешь команду, зажимаешь ЛКМ на угловом блоке и тянешь до другого, отпускаешь, ESC для разблокировки чата для следующей команды)"
    },
    {
        "name": "wp list",
        "note": "список путевых точек",
        "arg":[
            "list", // список путевых точек
            "save user ИМЯТОЧКИ", // установить путевую точку под ногами
            "save user ИМЯТОЧКИ x y z", // установить путевую точку в x y z
            "",
            "",
        ]
    }
]