var modsArray = [
	{
		"name":"Scaffold",
		"note":"позволяет быстро строится, возводить дома и сооружения, довольно популярный чит среди читеров строителей ловушек"
	},
	{
		"name":"AutoFish",
		"note":"автоматическая ловля рыбы"
	},
	{
		"name":"AutoArmor",
		"note":"автоматическое надевание лучшей брони в инвенторе, замена сломанных элементов брони на целые"
	},
	{
		"name":"FreeCam",
		"note":"позволяет свободно перемещать камеру по прогруженным чанкам"
	},
	{
		"name":"ToroHealth",
		"note":"отображаются баффы, броня, имена и остальные параметры цели"
	},
	{
		"name":"",
		"note":""
	},
	{
		"name":"",
		"note":""
	},
	{
		"name":"",
		"note":""
	},
	{
		"name":"",
		"note":""
	},
	{
		"name":"",
		"note":""
	},
]